## Import the relevant modules

In [7]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import sqlite3

## Grab the Data for our analysis

In [3]:
movie_gross_df = pd.read_csv('zippedData/bom.movie_gross.csv')
movie_gross_df.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [6]:
tmdb_df = pd.read_csv('zippeddata/tmdb.movies.csv')
tmdb_df.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

### Extract the relevant data from the IMDb database using SQL programming

##### We are most interested in the director and genres for movies.

In [8]:
con = sqlite3.connect('zippeddata/im.db')

In [9]:
table_name_query = """SELECT name 
                      AS 'Table Names' 
                      FROM sqlite_master 
                      WHERE type='table';"""

pd.read_sql(table_name_query, con)

     Table Names
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

### The IMDB data has this framework
![ERD For the IMDb Data](Images/IMDb_erd.jpeg "IMDb ERD").

In [10]:
query_1 = '''
SELECT 
        primary_name as Director,
        primary_title as Movie_Name,
        runtime_minutes as Length,
        genres,
        averagerating as AVG_Rating
        
        
FROM directors as d 
	JOIN persons as p
		on p.person_id = d.person_id
			JOIN movie_basics as mb
				on d.movie_id = mb.movie_id
                    JOIN movie_ratings as mr
                        on mr.movie_id = mb.movie_id

'''

director_movie_genre_df = pd.read_sql(query_1, con)

director_movie_genre_df

,Director,Movie_Name,Length,genres,AVG_Rating
0,Tony Vitale,Life's a Beach,100.0,Comedy,3.9
1,Bill Haley,Steve Phoenix: The Untold Story,110.0,Drama,5.5
2,Jay Chandrasekhar,The Babymakers,95.0,Comedy,5.0
3,Jay Chandrasekhar,The Babymakers,95.0,Comedy,5.0
4,Albert Pyun,Bulletface,82.0,Thriller,5.8
...,...,...,...,...,...
181382,Anne Sundberg,Reversing Roe,99.0,Documentary,7.4
181383,Mike Rohl,The Princess Switch,101.0,Romance,6.0
181384,Mike Rohl,The Princess Switch,101.0,Romance,6.0
181385,Richard Squires,Doozy,70.0,"Animation,Comedy",6.7
181386,Fredrik Horn Akselsen,Syndebukken: Prosessen mot Harry Lindstrøm,NaN,Documentary,8.4

### Connect the databases on movie title